configs/runs/hidden_bench/hidden_bench_imitation_classical_soft_control_smoke.yaml
# Cheap provider-free smoke run for the stochastic `soft_target` controller.
#
# Purpose (section 9 of docs/tdd/architecture/
# 11082026_soft_feedback_controller_implementation.md): before spending any
# provider budget, check that the soft policy actually fixes what it was built
# to fix.  The diagnostic is *not* H(U) > 0 - the hard threshold controller
# already had that.  It is whether both ADVOCATE_Z and NO_OP occur inside the
# same conditioning slice, because `target_actuation_cmi` conditions on Z_t and
# a single-action slice contributes nothing to it however many events it holds.
#
# Run from the repository root:
#   conda run -n MA-CC --no-capture-output python -m mas_cc.cli.main experiment run \
#     --config configs/runs/hidden_bench/hidden_bench_imitation_classical_soft_control_smoke.yaml \
#     --output-dir results
#
# Then read hidden_bench_imitation_analysis/information_estimates.md under the
# run directory, and compare `controller_action_entropy_bits` and the per-slice
# support against the matched threshold_target cell.
llm_provider:
  # Never contacted: dynamics_mode is classical and the budget below is zero.
  # Kept identical to the controlled reasoning arm so the smoke cell and the
  # real cells differ in exactly one setting.
  type: university
  model: gwdg/qwen3-30b-a3b-instruct-2507
  credentials_env: POTSDAM_API_KEY
  base_url_env: BASE_POTSDAM_LLM_URL
  timeout_seconds: 180
  max_retries: 2
  request_concurrency: 10
  temperature: 0.0
  max_output_tokens: 256
  options:
    estimated_latency_seconds: 3.0
prompt:
  schema_version: 2
  prompt_family: hidden_bench_imitation_update
  prompt_version: 1
  response_contract:
    type: hidden_bench_json_vote
    allowed_values: [West City, East Town, North Hill]
game:
  type: hidden_bench_imitation
  population_size: 4
  # Long enough that every Z_t slice from 0 to 4 is visited many times; the
  # collapse question is about within-slice support, not total event count.
  horizon: 400
  topology: complete
  options:
    task_set: vanilla
    task_id: evacuation_north_hill
    profile: hidden
    assignment_scheme: bijective
    dynamics_mode: classical
    pairing: uniform_two_distinct
    messages_per_agent: 1
    memory_size: 0
    allow_relay: true
    stop_on_consensus: false
    initialization:
      mode: explicit
      initial_votes: [East Town, East Town, North Hill, West City]
    classical:
      kernel: irisarri_multi_opinion
      forward_rate: 1.0
      reverse_rate: 1.0
      interaction_factor: destination_count_plus_offset
      interaction_offset: 1.0
      control_strength: 2.0
control:
  mechanism: soft_target
  options:
    target: correct
    sensor_sample_size: 2
    policy: soft_target
    threshold: 0.5
    # Inverse policy temperature.  P(ADVOCATE_Z) = sigma[beta * (threshold -
    # sampled target share)], so beta -> infinity is the old threshold_target
    # controller and small beta trades feedback strength for action overlap.
    # 4.0 is a starting point for the first experiments, not a tuned value;
    # section 11 explicitly rules out optimizing it here.
    beta: 4.0
    # 3 is the one fixed, factual-claim-free advocacy line.  It never takes
    # effect in classical mode - the classical actuator only reads the abstract
    # action - but stating it keeps this cell's controller identical on paper to
    # the reasoning cell it will be compared against.
    template_version: 3
execution:
  seed: 20260811
  repetitions: 4
  parallelism: 4
  fail_fast: false
pricing:
  mode: offline
  max_age_seconds: 86400
  require_fresh_at_launch: false
  fallback_policy: deny
  explicit_unknown_price_override: true
budget:
  # Zero across the board: a provider request from this run is a bug, and these
  # are the runtime guard that says so rather than a comment that hopes so.
  accounting_unit: proxy_accounting_unit
  system_max_cost_per_run: 0.0
  max_cost_per_run: 0.0
  max_provider_requests: 0
  max_input_tokens: 0
  max_output_tokens: 0
  allow_unbounded_paid_requests: false
logging:
  level: INFO
  console: true
  audit: true
  # OFF.  This is a local smoke test; it should not create a Comet experiment.
  comet: false
  options:
    show_metrics: true
storage:
  output_dir: results
  format: jsonl
  checkpoints: false
  overwrite: true
  wipe_and_recompute: true
analysis:
  enabled: true
  estimators:
    - sensing_mi
    - population_actuation_cmi
    - target_actuation_cmi
    - focal_actuation_cmi
  options:
    bootstrap_resamples: 200
    null_permutations: 200
    confidence: 0.95
    seed: 20260811
  comet_export: false
metrics:
  enabled: true
  comet_export: []
aggregation:
  schema_version: 1
  forward_fill: absorbing
  relabel_by_winner: false
  percentiles: [10, 50, 90]
  rolling_window: 1
  cell_metrics:
    - m_ctrl
    - u_advocate
    - sensor_target_share
  sweep_metrics: []
  horizons: [1]
  null_permutations: 0
observability:
  schema_version: 1
  comet:
    writer: master_only
    heartbeat_seconds: 20
    sweep_experiment: false
    cell_reporting: disabled
experiment:
  name: hidden-bench-imitation-classical-soft-control-smoke
  description: Provider-free smoke check that the soft feedback controller restores within-slice action overlap.
  tags: [hidden-bench, imitation, classical, control, soft-target, smoke]